# Ex. 27 - Titanic interpolation

pg. 148

If you’re getting data
ready to feed into a machine-learning model, you’ll likely need to get rid of the NaN
values, either by removing those rows or by replacing them with something else.

titanic3.xls has headers

In [21]:
import pandas as pd

In [22]:
# !conda install -y xlrd

In [23]:
df = pd.read_excel('../data/titanic3.xls')

In [24]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [29]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin        1013
embarked        0
boat          822
body         1186
home.dest     562
dtype: int64

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [27]:
df = df.dropna(subset=['fare', 'embarked'])

In [28]:
df['age'] = df['age'].fillna(df['age'].mean())

In [30]:
df['home.dest'].value_counts()

home.dest
New York, NY                          64
London                                14
Montreal, PQ                          10
Paris, France                          9
Cornwall / Akron, OH                   9
                                      ..
Seattle, WA / Toledo, OH               1
India / Rapid City, SD                 1
Kontiolahti, Finland / Detroit, MI     1
Devonport, England                     1
Antwerp, Belgium / Stanton, OH         1
Name: count, Length: 368, dtype: int64

In [31]:
df['home.dest'].mode()

0    New York, NY
Name: home.dest, dtype: object

In [32]:
df['home.dest'] = df['home.dest'].fillna(df['home.dest'].mode()[0])

In [76]:
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [34]:
df.isna().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin        1013
embarked        0
boat          822
body         1186
home.dest       0
dtype: int64

In [35]:
df['embarked'].value_counts()

embarked
S    913
C    270
Q    123
Name: count, dtype: int64

### Beyond 1
Create a series (most_common_destinations) in which the index contains the
unique values from the embarked column and the values are the most common
destination for each value of embarked.

In [41]:
import numpy as np
from pandas import Series, DataFrame

In [85]:
filename = '../data/titanic3.xls'

df = pd.read_excel(filename)
df.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [86]:
embarked_value = df['embarked'].dropna().unique()
embarked_value

array(['S', 'C', 'Q'], dtype=object)

In [87]:
most_common_destinations = Series([], dtype=object)
most_common_destinations

Series([], dtype: object)

In [88]:
for emb_val in embarked_value:
    most_common_destinations.loc[emb_val] = (df.loc[df['embarked']==emb_val, 'home.dest'].value_counts().index[0])

In [89]:
most_common_destinations

S           New York, NY
C           New York, NY
Q    Ireland Chicago, IL
dtype: object

In [90]:
most_common_destinations2 = Series([], dtype=object)

for emb_val in embarked_value:
    most_common_destinations2.loc[emb_val] = df.loc[df['embarked']==emb_val, 'home.dest'].mode()[0]

In [91]:
most_common_destinations2

S           New York, NY
C           New York, NY
Q    Ireland Chicago, IL
dtype: object

### Replace NaN values in the home.dest column with values from embarked.
(Because values in embarked and home.dest are distinct, this is an OK middle
step.)

In [92]:
df['home.dest'] = df['home.dest'].fillna(df['embarked'])

In [115]:
df['home.dest'].value_counts()

home.dest
S                                               379
C                                                98
Q                                                86
New York, NY                                     64
London                                           14
                                               ...
Chelsea, London                                   1
Harrow-on-the-Hill, Middlesex                     1
Copenhagen, Denmark                               1
Guernsey / Montclair, NJ and/or Toledo, Ohio      1
Antwerp, Belgium / Stanton, OH                    1
Name: count, Length: 372, dtype: int64

In [116]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest       1
dtype: int64

In [117]:
df_scq = df.loc[df['home.dest'].isin(['S','C', 'Q'])]

In [118]:
df_scq

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0,0,0,19877,78.8500,NaN,S,6,NaN,S
18,1,1,"Bazzani, Miss. Albina",female,32.0,0,0,11813,76.2917,D15,C,8,NaN,C
23,1,1,"Bidois, Miss. Rosalie",female,42.0,0,0,PC 17757,227.5250,NaN,C,4,NaN,C
24,1,1,"Bird, Miss. Ellen",female,29.0,0,0,PC 17483,221.7792,C97,S,8,NaN,S
28,1,1,"Bissette, Miss. Amelia",female,35.0,0,0,PC 17760,135.6333,C99,S,8,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,C
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,S

In [119]:
df_scqc = df_scq.copy()

In [120]:
df_scqc['home.dest'] = df_scqc['home.dest'].replace(most_common_destinations)

In [121]:
df_scqc

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0,0,0,19877,78.8500,NaN,S,6,NaN,"New York, NY"
18,1,1,"Bazzani, Miss. Albina",female,32.0,0,0,11813,76.2917,D15,C,8,NaN,"New York, NY"
23,1,1,"Bidois, Miss. Rosalie",female,42.0,0,0,PC 17757,227.5250,NaN,C,4,NaN,"New York, NY"
24,1,1,"Bird, Miss. Ellen",female,29.0,0,0,PC 17483,221.7792,C97,S,8,NaN,"New York, NY"
28,1,1,"Bissette, Miss. Amelia",female,35.0,0,0,PC 17760,135.6333,C99,S,8,NaN,"New York, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,"New York, NY"
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,"New York, NY"
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,"New York, NY"
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,"New York, NY"
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,"New York, NY"

### Use the most_common_destinations series to replace values in home.dest with the most common values for each embarkation point.

In [122]:
df['home.dest'].isnull().sum()

1

In [123]:
df['home.dest'].value_counts()

home.dest
S                                               379
C                                                98
Q                                                86
New York, NY                                     64
London                                           14
                                               ...
Chelsea, London                                   1
Harrow-on-the-Hill, Middlesex                     1
Copenhagen, Denmark                               1
Guernsey / Montclair, NJ and/or Toledo, Ohio      1
Antwerp, Belgium / Stanton, OH                    1
Name: count, Length: 372, dtype: int64

In [124]:
df['home.dest'] = df['home.dest'].replace(most_common_destinations)

In [125]:
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,"New York, NY"
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,"New York, NY"
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,"New York, NY"
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,"New York, NY"
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,"New York, NY"

In [127]:
df['home.dest'].value_counts()

home.dest
New York, NY                      541
Ireland Chicago, IL                90
London                             14
Montreal, PQ                       10
Paris, France                       9
                                 ...
Bennington, VT                      1
Chelsea, London                     1
Harrow-on-the-Hill, Middlesex       1
Copenhagen, Denmark                 1
Antwerp, Belgium / Stanton, OH      1
Name: count, Length: 369, dtype: int64